## Plan Result (nonprod_general - TerraformPlanApply)




<pre><code>Plan: 4 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_application_gateway.ag
  * azurerm_public_ip.app_gw
  * azurerm_role_assignment.identity
  * azurerm_user_assigned_identity.identity
* Update
  * module.networking.azurerm_subnet.this[&#34;atlassian-dmz-nonprod-vnet-atlassian-dmz-subnet&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_gateway.ag will be created
  + resource "azurerm_application_gateway" "ag" {
      + id                          = (known after apply)
      + location                    = "uksouth"
      + name                        = "atlasssian-nonprod-app-gateway"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "atlassian-nonprod-rg"
      + tags                        = {
          + "application"  = "atlassian"
          + "builtFrom"    = "hmcts/atlassian-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }

      + autoscale_configuration {
          + max_capacity = 2
          + min_capacity = 1
        }

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.0.4.201",
              + "10.0.4.202",
              + "10.0.4.203",
            ]
          + name         = "appgw-backend-pool-jira"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.0.4.210",
            ]
          + name         = "appgw-backend-pool-crd"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.0.4.215",
              + "10.0.4.216",
            ]
          + name         = "appgw-backend-pool-cnf"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Enabled"
          + id                                  = (known after apply)
          + name                                = "appgw-backend-settings-crd"
          + pick_host_name_from_backend_address = true
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "appgw-probe-crd"
          + protocol                            = "Http"
          + request_timeout                     = 300
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)

          + connection_draining {
              + drain_timeout_sec = 15
              + enabled           = false
            }
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Enabled"
          + id                                  = (known after apply)
          + name                                = "appgw-backend-settings-cnf"
          + pick_host_name_from_backend_address = true
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "appgw-probe-cnf"
          + protocol                            = "Http"
          + request_timeout                     = 300
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)

          + connection_draining {
              + drain_timeout_sec = 15
              + enabled           = true
            }
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Enabled"
          + id                                  = (known after apply)
          + name                                = "appgw-backend-settings-jira"
          + pick_host_name_from_backend_address = true
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "appgw-probe-jira"
          + protocol                            = "Http"
          + request_timeout                     = 300
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)

          + connection_draining {
              + drain_timeout_sec = 15
              + enabled           = true
            }
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPublicFrontendIp"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "http"
          + port = 80
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "https"
          + port = 443
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "gateway"
          + subnet_id = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-dmz-nonprod-vnet/subnets/atlassian-dmz-subnet-appgw"
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "appgw-http-listener"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "staging.tools.hmcts.net"
          + ssl_profile_id                 = (known after apply)
            # (3 unchanged attributes hidden)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_http_settings_id    = (known after apply)
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-routing-rule"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (4 unchanged attributes hidden)
        }

      + sku {
          + name = "WAF_v2"
          + tier = "WAF_v2"
        }

      + ssl_policy (known after apply)

      + url_path_map {
          + default_backend_address_pool_id    = (known after apply)
          + default_backend_address_pool_name  = "appgw-backend-pool-cnf"
          + default_backend_http_settings_id   = (known after apply)
          + default_backend_http_settings_name = "appgw-backend-settings-cnf"
          + default_redirect_configuration_id  = (known after apply)
          + default_rewrite_rule_set_id        = (known after apply)
          + id                                 = (known after apply)
          + name                               = "appgw-url-map-path"

          + path_rule {
              + backend_address_pool_id    = (known after apply)
              + backend_address_pool_name  = "appgw-backend-pool-cnf"
              + backend_http_settings_id   = (known after apply)
              + backend_http_settings_name = "appgw-backend-settings-cnf"
              + id                         = (known after apply)
              + name                       = "confluence"
              + paths                      = [
                  + "/confluence*",
                ]
              + redirect_configuration_id  = (known after apply)
              + rewrite_rule_set_id        = (known after apply)
            }
          + path_rule {
              + backend_address_pool_id    = (known after apply)
              + backend_address_pool_name  = "appgw-backend-pool-crd"
              + backend_http_settings_id   = (known after apply)
              + backend_http_settings_name = "appgw-backend-settings-crd"
              + id                         = (known after apply)
              + name                       = "crowd"
              + paths                      = [
                  + "/crowd*",
                ]
              + redirect_configuration_id  = (known after apply)
              + rewrite_rule_set_id        = (known after apply)
            }
          + path_rule {
              + backend_address_pool_id    = (known after apply)
              + backend_address_pool_name  = "appgw-backend-pool-jira"
              + backend_http_settings_id   = (known after apply)
              + backend_http_settings_name = "appgw-backend-settings-jira"
              + id                         = (known after apply)
              + name                       = "jira"
              + paths                      = [
                  + "/jira*",
                ]
              + redirect_configuration_id  = (known after apply)
              + rewrite_rule_set_id        = (known after apply)
            }
        }

      + waf_configuration {
          + enabled                  = true
          + file_upload_limit_mb     = 100
          + firewall_mode            = "Prevention"
          + max_request_body_size_kb = 128
          + request_body_check       = true
          + rule_set_type            = "OWASP"
          + rule_set_version         = "3.2"
        }
    }

  # azurerm_public_ip.app_gw will be created
  + resource "azurerm_public_ip" "app_gw" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "atlasssian-nonprod-public-ip"
      + resource_group_name     = "atlassian-nonprod-rg"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "application"  = "atlassian"
          + "builtFrom"    = "hmcts/atlassian-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
    }

  # azurerm_role_assignment.identity will be created
  + resource "azurerm_role_assignment" "identity" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.identity will be created
  + resource "azurerm_user_assigned_identity" "identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "atlasssian-nonprod-app-gateway-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "atlassian-nonprod-rg"
      + tags                = {
          + "application"  = "atlassian"
          + "builtFrom"    = "hmcts/atlassian-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + tenant_id           = (known after apply)
    }

  # module.networking.azurerm_subnet.this["atlassian-dmz-nonprod-vnet-atlassian-dmz-subnet"] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/virtualNetworks/atlassian-dmz-nonprod-vnet/subnets/atlassian-dmz-subnet"
        name                                          = "atlassian-dmz-subnet"
      ~ service_endpoints                             = [
          - "Microsoft.Storage",
        ]
        # (7 unchanged attributes hidden)

      - delegation {
          - name = "dlg-Microsoft.DBforPostgreSQL-flexibleServers" -> null

          - service_delegation {
              - actions = [
                  - "Microsoft.Network/virtualNetworks/subnets/join/action",
                ] -> null
              - name    = "Microsoft.DBforPostgreSQL/flexibleServers" -> null
            }
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2,"Program":"tfcmt","SHA1":"","Target":"nonprod_general - TerraformPlanApply","Vars":{}} -->